In [3]:
import pandas as pd
st_per = pd.read_csv('C:/StudentsPerformance.csv')
st_per

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [4]:
st_per.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [5]:
st_per[st_per['math score']<25]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
17,female,group B,some high school,free/reduced,none,18,32,28
59,female,group C,some high school,free/reduced,none,0,17,10
145,female,group C,some college,free/reduced,none,22,39,33
338,female,group B,some high school,free/reduced,none,24,38,27
787,female,group B,some college,standard,none,19,38,32
842,female,group B,high school,free/reduced,completed,23,44,36
980,female,group B,high school,free/reduced,none,8,24,23

In [11]:
data = st_per[(st_per['gender'] == 'male') | (st_per['race/ethnicity']== 'group A')]
c =0
for i in data['race/ethnicity']:
    c +=1
c

518

In [13]:
data = st_per[(st_per['gender']=='female') & (st_per['lunch']=='standard')]
c =0
for i in st_per['lunch']:
    c +=1
c

1000

In [16]:
st_per['math score'].sort_values(ascending = True)

59       0
980      8
17      18
787     19
145     22
      ...
962    100
625    100
916    100
458    100
451    100
Name: math score, Length: 1000, dtype: int64

In [17]:
import pandas  as pd

data = {
    'Name':['Rohan','Vinod','Pushpa','Tushar','Eera'],
    'Age':[18,23,34,23,1],
    'City':['Mumbai','Delhi','Punjab','Pune','Gujrat'],
    'Salary':[23000,34000,45000,34000,43000],
    'Country':['India','China','Nepal','Bangladesh','Italy'],

}

df = pd.DataFrame(data)
print(df)

     Name  Age    City  Salary     Country
0   Rohan   18  Mumbai   23000       India
1   Vinod   23   Delhi   34000       China
2  Pushpa   34  Punjab   45000       Nepal
3  Tushar   23    Pune   34000  Bangladesh
4    Eera    1  Gujrat   43000       Italy

In [18]:
st_per.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50

In [19]:
st_per.tail(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
990,male,group E,high school,free/reduced,completed,86,81,75
991,female,group B,some high school,standard,completed,65,82,78
992,female,group D,associate's degree,free/reduced,none,55,76,76
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
994,male,group A,high school,standard,none,63,63,62
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86